[
  {
    "id": 1,
    "time": -2000000,
    "title": "First Homo expansion out of Africa",
    "lat": 12.5,
    "lon": 43.3,
    "type": "古人类扩散",
    "desc": "Earliest hominin expansions into Eurasia (~2.0–1.8 Ma)."
  },
  {
    "id": 2,
    "time": -70000,
    "title": "Modern human main Out-of-Africa expansion",
    "lat": 22.0,
    "lon": 66.9,
    "type": "现代人迁徙",
    "desc": "Main pulse ~70–50 ka."
  },
  {
    "id": 3,
    "time": -400000,
    "title": "Emergence of early Neanderthal–Denisovan ancestry",
    "lat": 50.0,
    "lon": 10.0,
    "type": "古人类谱系",
    "desc": "Genomic divergence between the Neanderthal and Denisovan lineages began around 400–450 ka, following earlier separation from Homo sapiens ancestors.",
    "harvard_refs": [
      "Prüfer, K. et al. (2014) The complete genome sequence of a Neanderthal from the Altai Mountains. Nature, 505, 43–49.",
      "Meyer, M. et al. (2012) A high-coverage genome sequence from an archaic Denisovan individual. Science, 338, 222–226."
    ]
  },
  {
    "id": 4,
    "time": -300000,
    "title": "Denisovan population in Altai region",
    "lat": 52.0,
    "lon": 84.0,
    "type": "古人类",
    "desc": "Denisovans inhabited southern Siberia (Altai) by at least 300 ka, leaving DNA traces later detected in modern populations of Oceania and Asia.",
    "harvard_refs": [
      "Meyer, M. et al. (2012) A high-coverage genome sequence from an archaic Denisovan individual. Science, 338, 222–226."
    ]
  },
  {
    "id": 6,
    "time": -150000,
    "title": "Emergence of Homo sapiens in Africa",
    "lat": 10.0,
    "lon": 35.0,
    "type": "现代人起源",
    "desc": "Fossils from Omo Kibish (~195 ka) and Herto (~160 ka) in Ethiopia represent early anatomically modern humans; genetic evidence suggests African population structure before Out-of-Africa expansion.",
    "harvard_refs": [
      "White, T.D. et al. (2003) Pleistocene Homo sapiens from Middle Awash, Ethiopia. Nature, 423, 742–747.",
      "Scerri, E.M.L. et al. (2018) Did our species evolve in subdivided populations across Africa? Trends in Ecology & Evolution, 33, 582–594."
    ]
  },
  {
    "id": 8,
    "time": -50000,
    "title": "Neanderthal admixture with modern humans",
    "lat": 37.0,
    "lon": 40.0,
    "type": "人群交流",
    "desc": "Ancient DNA revealed gene flow from Neanderthals into non-African modern humans, occurring soon after the Out-of-Africa expansion (~50–60 ka).",
    "harvard_refs": [
      "Green, R.E. et al. (2010) A draft sequence of the Neandertal genome. Nature, 464, 711–716."
    ]
  },
  {
    "id": 9,
    "time": -45000,
    "title": "Denisovan introgression into East and Southeast Asia",
    "lat": 15.0,
    "lon": 110.0,
    "type": "人群交流",
    "desc": "Genetic data show introgression from Denisovans into ancestors of present-day East and Southeast Asians (SEA), Papuans and Aboriginal Australians.",
    "harvard_refs": [
      "Reich, D. et al. (2011) Denisova admixture and the genetic history of Melanesia. Nature, 468, 1053–1060.",
      "Browning, S.R. et al. (2018) Analysis of human sequence data reveals two pulses of Denisovan admixture. Cell, 173, 53–61."
    ]
  },
  {
    "id": 10,
    "time": -15000,
    "title": "Postglacial diversification of Eurasian populations",
    "lat": 48.0,
    "lon": 20.0,
    "type": "人群演化",
    "desc": "Genomes from Upper Palaeolithic and Mesolithic Europe show population turnovers and structure leading to present-day West Eurasian ancestry.",
    "harvard_refs": [
      "Lazaridis, I. et al. (2014) Ancient human genomes suggest three ancestral populations for present-day Europeans. Nature, 513, 409–413.",
      "Fu, Q. et al. (2016) The genetic history of Ice Age Europe. Nature, 534, 200–205."
    ]
  },
  {
    "id": 11,
    "time": -10000,
    "title": "Neolithic transition: origin of farming in the Near East",
    "lat": 36.5,
    "lon": 38.5,
    "type": "农业起源",
    "desc": "Genome data from Pre-Pottery Neolithic farmers in the Fertile Crescent show that agriculture arose independently from local hunter-gatherers.",
    "harvard_refs": [
      "Lazaridis, I. et al. (2016) Genomic insights into the origin of farming in the ancient Near East. Nature, 536, 419–424.",
      "Broushaki, F. et al. (2016) Early Neolithic genomes from the eastern Fertile Crescent. Science, 353, 499–503."
    ]
  },
  {
    "id": 12,
    "time": -9000,
    "title": "Independent domestication of rice and millet in East Asia",
    "lat": 32.0,
    "lon": 112.0,
    "type": "农业起源",
    "desc": "Ancient genomes indicate independent domestication centers for rice (Yangtze basin) and millet (Yellow River), marking distinct Neolithic transitions in East Asia.",
    "harvard_refs": [
      "Zhang, G. et al. (2020) Genomic insights into domestication of Asian rice. Science, 367, 1462–1466.",
      "Yang, M.A. et al. (2020) Ancient DNA indicates human population shifts and rice agriculture in East Asia. Cell, 183, 890–904."
    ]
  },
  {
    "id": 13,
    "time": -6000,
    "title": "Domestication of animals and genomic introgression",
    "lat": 38.0,
    "lon": 45.0,
    "type": "动物驯化",
    "desc": "Ancient genomes from early domestic pigs, cattle, and horses show multiple domestication centers and later gene flow between East and West Eurasia.",
    "harvard_refs": [
      "Frantz, L.A.F. et al. (2019) Ancient pigs reveal multiple domestication centers and gene flow. Nature, 566, 234–238.",
      "Librado, P. et al. (2021) The origins and spread of domestic horses from the Western Eurasian steppes. Science, 373, 131–136."
    ]
  },
  {
    "id": 14,
    "time": -4800,
    "title": "Emergence of Yersinia pestis and its spread along prehistoric trade routes",
    "lat": 55.0,
    "lon": 60.0,
    "type": "病原体传播",
    "desc": "Ancient DNA from the Bronze Age shows early plague spread across Eurasia with human migrations and trade, predating historical pandemics.",
    "harvard_refs": [
      "Rasmussen, S. et al. (2015) Early divergent strains of Yersinia pestis in Eurasia 5,000 years ago. Cell, 163, 571–582.",
      "Spyrou, M.A. et al. (2018) Ancient pathogen genomics reveals persistent Yersinia pestis infection through time. Nature, 565, 386–390."
    ]
  },
  {
    "id": 22,
    "time": -6500,
    "title": "Originators of Indo-European language family from steppe/Caucasus",
    "lat": 46.0,
    "lon": 48.0,
    "type": "人群迁徙",
    "desc": "Ancient-DNA analyses identify a Caucasus–Lower Volga population (~6.5 ka, Copper Age) as originators of Proto-Indo-European, predating classic Yamnaya migrations. (Steppe_IE)",
    "harvard_refs": [
      "Harvard Medical School News. (2025) Ancient-DNA study identifies originators of Indo-European language family. Nature, 2025."
    ]
  },
  {
    "id": 23,
    "time": -4000,
    "title": "Large-scale DNA study maps 37,000 years of disease history",
    "lat": 50.0,
    "lon": 20.0,
    "type": "病原体传播",
    "desc": "Analysis of >1,300 prehistoric human genomes reveals spatiotemporal distribution of human pathogens across Eurasia. (Pathogen_Eurasia)",
    "harvard_refs": [
      "Phys.org. (2025) Large-scale DNA study maps 37,000 years of disease history. Nature, 2025."
    ]
  },
  {
    "id": 24,
    "time": -2500,
    "title": "Ancient genomes from New Guinea coastal communities reveal regional migration patterns",
    "lat": -9.0,
    "lon": 147.0,
    "type": "人群迁徙",
    "desc": "Ancient DNA, dietary and linguistic data show migration and local interactions in coastal Papua New Guinea over the past ~2,500 years. (PNG_Coastal)",
    "harvard_refs": [
      "Nägele, K. et al. (2025) Ancient DNA analysis reveals regional migration patterns and local interactions in coastal Papua New Guinea. Nature Ecology & Evolution, 2025."
    ]
  },
  {
    "id": 18,
    "time": 600,
    "title": "Large-scale population movement from Eastern Europe during 6th–8th centuries",
    "lat": 52.0,
    "lon": 17.0,
    "type": "人群迁徙",
    "desc": "Ancient DNA shows >80% ancestry replacement in Eastern Europe during 6th–8th centuries AD. (Early Medieval Europe)",
    "harvard_refs": [
      "Gretzinger, J. et al. (2025) Ancient DNA connects large-scale migration with the early medieval transformation of Europe. Nature, 2025."
    ]
  }
]
